Res-firecracker-set-v66/firecracker_t_4_c_6_frontVcpu_1_wrkVcpu_1/wrk.txt
Running 1m test @ http://frontend:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 5026.980ms, rate sampling interval: 17842ms
  Thread calibration: mean lat.: 5080.588ms, rate sampling interval: 16875ms
  Thread calibration: mean lat.: 5073.427ms, rate sampling interval: 17989ms
  Thread calibration: mean lat.: 4960.801ms, rate sampling interval: 16334ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    19.31s     7.64s   34.73s    76.50%
    Req/Sec   217.89      2.02   220.00     88.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.70s 
 75.000%   25.54s 
 90.000%   32.93s 
 99.000%   34.73s 
 99.900%   35.09s 
 99.990%   35.26s 
 99.999%   35.26s 
100.000%   35.26s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8683.519     0.000000            1         1.00
   11902.975     0.100000         4382         1.11
   12640.255     0.200000         8742         1.25
   13369.343     0.300000        13108         1.43
   14622.719     0.400000        17479         1.67
   15704.063     0.500000        21817         2.00
   16334.847     0.550000        24014         2.22
   18497.535     0.600000        26179         2.50
   23379.967     0.650000        28366         2.86
   25001.983     0.700000        30591         3.33
   25542.655     0.750000        32721         4.00
   25837.567     0.775000        33857         4.44
   26116.095     0.800000        34922         5.00
   26460.159     0.825000        36021         5.71
   28131.327     0.850000        37083         6.67
   32292.863     0.875000        38177         8.00
   32669.695     0.887500        38743         8.89
   32931.839     0.900000        39275        10.00
   33161.215     0.912500        39813        11.43
   33390.591     0.925000        40360        13.33
   33619.967     0.937500        40980        16.00
   33685.503     0.943750        41173        17.78
   33783.807     0.950000        41471        20.00
   33882.111     0.956250        41741        22.86
   33980.415     0.962500        42016        26.67
   34111.487     0.968750        42311        32.00
   34177.023     0.971875        42445        35.56
   34242.559     0.975000        42565        40.00
   34340.863     0.978125        42714        45.71
   34439.167     0.981250        42842        53.33
   34537.471     0.984375        42972        64.00
   34570.239     0.985938        43015        71.11
   34635.775     0.987500        43091        80.00
   34701.311     0.989062        43171        91.43
   34766.847     0.990625        43248       106.67
   34799.615     0.992188        43290       128.00
   34832.383     0.992969        43330       142.22
   34865.151     0.993750        43371       160.00
   34897.919     0.994531        43405       182.86
   34930.687     0.995313        43436       213.33
   34963.455     0.996094        43475       256.00
   34963.455     0.996484        43475       284.44
   34996.223     0.996875        43515       320.00
   34996.223     0.997266        43515       365.71
   35028.991     0.997656        43544       426.67
   35028.991     0.998047        43544       512.00
   35061.759     0.998242        43572       568.89
   35061.759     0.998437        43572       640.00
   35061.759     0.998633        43572       731.43
   35094.527     0.998828        43592       853.33
   35094.527     0.999023        43592      1024.00
   35094.527     0.999121        43592      1137.78
   35094.527     0.999219        43592      1280.00
   35127.295     0.999316        43601      1462.86
   35127.295     0.999414        43601      1706.67
   35160.063     0.999512        43605      2048.00
   35192.831     0.999561        43611      2275.56
   35192.831     0.999609        43611      2560.00
   35192.831     0.999658        43611      2925.71
   35225.599     0.999707        43619      3413.33
   35225.599     0.999756        43619      4096.00
   35225.599     0.999780        43619      4551.11
   35225.599     0.999805        43619      5120.00
   35225.599     0.999829        43619      5851.43
   35225.599     0.999854        43619      6826.67
   35258.367     0.999878        43625      8192.00
   35258.367     1.000000        43625          inf
#[Mean    =    19308.897, StdDeviation   =     7639.548]
#[Max     =    35225.600, Total count    =        43625]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  52237 requests in 1.00m, 21.60MB read
Requests/sec:    870.59
Transfer/sec:    368.62KB